app/views/users/show.html.erb

          <div class="span5">
            <% if @users.microposts.any? %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1