app/controllers/auctions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN (1)
SELECT "auctions".* FROM "auctions" LIMIT 1 OFFSET 0
---
  def index
    @user = User.find(params[:user_id])
    @auctions = Auction.paginate(page: params[:page])

INSERT INTO "auctions" ("category", "cost", "created_at", "descrip", "goog_url", "img_url", "integer", "lic_or_sell", "pat_num", "pat_off_desc", "pat_type", "phone_num", "pic1_content_type", "pic1_file_name", "pic1_file_size", "pic1_updated_at", "pic2_content_type", "pic2_file_name", "pic2_file_size", "pic2_updated_at", "pic3_content_type", "pic3_file_name", "pic3_file_size", "pic3_updated_at", "pic4_content_type", "pic4_file_name", "pic4_file_size", "pic4_updated_at", "pic5_content_type", "pic5_file_name", "pic5_file_size", "pic5_updated_at", "pic_descr_1", "pic_descr_2", "pic_descr_3", "pic_descr_4", "pic_descr_5", "slug", "timer_day", "timer_hr", "timer_min", "title", "updated_at", "user_id", "user_name", "vid_url", "video_content_type", "video_file_name", "video_file_size", "video_updated_at", "why_sell") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "auctions" SET "user_id" = 1, "updated_at" = '2013-07-04 20:40:34.926411' WHERE "auctions"."id" = 1
---
	def create
		@auction = Auction.create(params[:auction])
		@auction.user_id = current_user.id
    if @auction.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	def show
		@auction = Auction.find(params[:id])
    @user = User.find_by_id(@auction.user_id)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def edit
    @user = User.find_by_id(@auction.user_id)

UPDATE "auctions" SET "pic2_file_name" = 'getting-back-on-track-L-2OrxGG.jpeg', "pic2_content_type" = 'image/jpeg', "pic2_file_size" = 12304, "pic2_updated_at" = '2013-07-04 20:42:33.253870', "pic_descr_2" = 'SUCCESS!!', "updated_at" = '2013-07-04 20:42:33.549808' WHERE "auctions"."id" = 1
---
  def update
    @auction = Auction.find(params[:id])
    if @auction.update_attributes(params[:auction])