app/controllers/messengers_controller.rb

INSERT INTO "messengers" ("body", "created_at", "message_attach_content_type", "message_attach_file_name", "message_attach_file_size", "message_attach_updated_at", "read_at", "recipient_deleted", "recipient_id", "sender_deleted", "sender_id", "subject", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @messenger = Messenger.new(params[:messenger])
    @messenger.sender = current_user
    @messenger.recipient = User.find(@@suser)

    if @messenger.save

SELECT "messengers".* FROM "messengers" WHERE (messengers.id = '1' AND (sender_id = 1 OR recipient_id = 1)) ORDER BY messengers.created_at ASC LIMIT 1
---
  def delete_selected
    if request.post?
      if params[:delete]
        params[:delete].each { |id|
          @messenger = Messenger.find(:first, :conditions => ["messengers.id = ? AND (sender_id = ? OR recipient_id = ?)", id, @user, @user])