app/controllers/static_pages_controller.rb

SELECT "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def home
  	if signed_in?
  		@user = current_user
  		@micropost = @user.microposts.build
    	@feed_items = @user.feed.paginate(page: params[:page])