app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"
---
	def index
    @users = User.order(:created_at).page(params[:page]).per_page(10)

SELECT "users".* FROM "users" ORDER BY name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"
---
	def lawyers
		@users = User.order(:name).page(params[:page]).per_page(10)

SELECT "auctions".* FROM "auctions" LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "auctions"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
---
	def show
    @auctions = Auction.paginate(page: params[:page], per_page: 15)
		@user = User.find(params[:id])
		@microposts = @user.microposts.paginate(page: params[:page], per_page: 15)

INSERT INTO "users" ("admin", "agent_or_lawyer", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "billable_hours", "billable_rate", "created_at", "email", "firm", "firm_site", "lawyer", "name", "password_digest", "pat_bar_num", "pat_buy", "pat_selling", "pat_sold", "remember_token", "sex", "slug", "updated_at", "years_practicing") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "remember_token" = 'AmE_MyDKI9vcVqFQqLuq1w', "updated_at" = '2013-07-03 05:02:36.895328' WHERE "users"."id" = 1
---
  def create
  	params[:user]
		@user = User.create(params[:user])
		if @user.save

UPDATE "users" SET "email" = 'puait03@gmail.com', "password_digest" = '$2a$10$jWnTdbBq/SibhJzyXPmHpuv6T0VUfqwFXSpHuyjOYNUymrM8slRK6', "remember_token" = 'O4I2rBDUf-8grubvK25qpw', "updated_at" = '2013-07-03 06:39:02.789089' WHERE "users"."id" = 1
---
	def update
		if @user.update_attributes(params[:user])